from string import Template

from states.user import User_States

TEMPLATE_START = Template("Добро пожаловать $user. Выберите кто вы.")
NOTIFY = "Хотите ли вы получать уведомления?"
CHOOSE_CLASS_DICT = {
    "student": "Введите ваш класс, а затем букву, например - 7Б",
    "parent": "Введите класс, а затем букву вашего ребёнка, например - 7Б",
}
CHOOSE_CLASS_TRY_AGAIN = "Неправильно, попробуйте снова\n"
REGISTR_SUCCESSFUL = "Регистрация завершена"
CHOOSE_PROFILE = "Выберите ваши профильные предметы, а затем нажмите Готово"
YES_NO_NOTIFY = "Хотите ли вы получать уведомления о изменении расписания?"
CONFIRMATION_RESET = (
    "Вы действительно хотите сбросить настройки и зарегистрироваться заново?"
)
TEMPLATE_RESET_NOTFY = Template("Уведомления $state_notify")
CANCEL_RESET = "Хорошо"
TECHNICAL_WORK = "В данный момент ведуться технические работы, попробуйте позже"
START_MENU_TEXT = {
    "student": "Введите ваш класс, а затем букву, например - 7Б",
    "parent": "Введите класс, а затем букву вашего ребёнка, например - 7Б",
    "teacher": YES_NO_NOTIFY,
}
START_MENU_STATE = {
    "👨‍👨‍👦Родитель": User_States.choose_class,
    "👩🏻‍🏫Учитель": User_States.yes_no_notify,
    "🎓Ученик": User_States.choose_class,
}
DICT_PROFILES = {
    "Society": "Общество",
    "History": "История",
    "English": "Английский язык",
    "CS": "Информатика",
    "Math": "Математика",
    "Physics": "Физика",
    "Chemistry": "Химия",
    "Biology": "Биология",
}
START_QUESTION = "Вы хотите попасть сбросить настройки или попасть в меню?"
NOT_REGISTR = "Сначала вам нужно зарегистрироваться, для этого вы можете сбросить настройки, воспользовшись коммандой /start"
BOT_NOT_FOR_JUNS = "Бот доступен с 5 по 11 класс"
LIST_TEXT = [
    [
        "Математика",
        "Русский язык",
        "Литература",
        "Физика",
        "Информатика",
        "Биология",
        "Химия",
        "Общество",
        "История",
        "География",
        "Физкультура",
        "Музыка",
        "Технология",
        "ОБЖ",
        "Иностранный язык",
        "Немецкий язык",
        "Черчение",
        "ИЗО",
    ],
    [],
]
TEXT_FOR_KB = {
    # "start_menu": ["👨‍👨‍👦Родитель", "🎓Ученик"],
    "start_menu": ["👩🏻‍🏫Учитель", "👨‍👨‍👦Родитель", "🎓Ученик"],
    "yes_no": ["❌Нет", "✅Да"],
    "menu": ["👤Профиль", "⚙Настройки", "🗓Расписаниe"],
    "schedule": ["🗓На сегодня", "🔙Назад", "🗓На завтра"],
    "all_schedule": ["🗓На сегодня", "🔙Назад", "🗓На завтра", "🗓1 смена", "🗓2 смена"],
    "student_schedule": ["🗓На сегодня", "🔙Назад", "🗓На завтра"],
    "parent_schedule": ["🗓На сегодня", "🔙Назад", "🗓На завтра"],
    "teacher_schedule": ["🗓2 смена", "🔙Назад", "🗓1 смена"],
    "settings": [
        "⚙Сбросить настройки",
        "🔙Назад",
        "🔔Включить уведомления",
        "🔔Выключить уведомления",
    ],
    "menu_or_reset": ["⚙Сбросить настройки", "☰Меню"],
}
PERSON_TYPE_TEXTS = {
    "parent": "Родитель",
    "teacher": "Учитель",
    "student": "Ученик",
}
PERSON_TYPE_FOR_DB = {
    "👨‍👨‍👦Родитель": "parent",
    "👩🏻‍🏫Учитель": "teacher",
    "🎓Ученик": "student",
}
FIRST_SHIFT_CLASSES = [
    "5А",
    "5Б",
    "5В",
    "5Г",
    "5Д",
    "7А",
    "7Б",
    "7В",
    "7Г",
    "7Д",
    "9А",
    "9Б",
    "9В",
    "9Г",
    "9Д",
    "11А",
    "11Б",
]
SECOND_SHIFT_CLASSES = [
    "6А",
    "6Б",
    "6В",
    "6Г",
    "6Д",
    "8А",
    "8Б",
    "8В",
    "8Г",
    "8Д",
    "10А",
    "10Б",
]
CLASSES_BY_SHIFT = {
    1: [
        "5А",
        "5Б",
        "5В",
        "5Г",
        "5Д",
        "7А",
        "7Б",
        "7В",
        "7Г",
        "7Д",
        "9А",
        "9Б",
        "9В",
        "9Г",
        "9Д",
        "11А",
        "11Б",
    ],
    2: [
        "6А",
        "6Б",
        "6В",
        "6Г",
        "6Д",
        "8А",
        "8Б",
        "8В",
        "8Г",
        "8Д",
        "10А",
        "10Б",
    ],
}
SCHOOL_DAYS = [
    "понедельник",
    "вторник",
    "среда",
    "четверг",
    "пятница",
    "суббота",
]
DAYS = [
    "понедельник",
    "вторник",
    "среда",
    "четверг",
    "пятница",
    "суббота",
    "воскресенье",
]
TIME_BEGINNINGS_THE_LESSONS_FOR_SHIFT = {
    "1 смена": ["8.00", "8.45", "9.35", "10.30", "11.25", "12.20", "13.10", "14.00"],
    "2 смена": ["12.20", "13.10", "14.00", "14.55", "15.50", "16.45", "17.35", "18.20"],
    "суббота": [
        "8.00",
        "8.45",
        "9.30",
        "10.20",
        "11.10",
        "12.00",
        "12.50",
        "13.35",
        "14.20",
        "15.05",
    ],
}
